     Hdebug
     C                   exsr      @lcaut
     C                   dump
     C                   return
     C/copy qrpglesrc,@LCAUT@C
